In [4]:
import pandas as pd
import numpy as np
from pandas import Series, DataFrame

In [5]:
ser1=Series([1,2,3], index=['A','B','C'])
ser1

A    1
B    2
C    3
dtype: int64

In [6]:
ser2=Series([3,4,5,6], index=['A','B','C','D'])
ser2

A    3
B    4
C    5
D    6
dtype: int64

In [7]:
ser1 + ser2

A    4.0
B    6.0
C    8.0
D    NaN
dtype: float64

In [8]:
dataframe1=DataFrame(np.arange(4).reshape(2,2), columns=['A','B'], index=['NYC','LA'])
dataframe1

     A  B
NYC  0  1
LA   2  3

In [9]:
dataframe2=DataFrame(np.arange(9).reshape(3,3), columns=list('ABC'), index=['NYC','LA','CHI'])
dataframe2

     A  B  C
NYC  0  1  2
LA   3  4  5
CHI  6  7  8

In [10]:
dataframe1 + dataframe2

       A    B   C
CHI  NaN  NaN NaN
LA   5.0  7.0 NaN
NYC  0.0  2.0 NaN

In [11]:
dataframe1

     A  B
NYC  0  1
LA   2  3

In [15]:
dataframe1.add(dataframe2, fill_value=2)

       A    B     C
CHI  8.0  9.0  10.0
LA   5.0  7.0   7.0
NYC  0.0  2.0   4.0

In [13]:
ser3=dataframe2.ix[0]
ser3

C:\Users\DELL\Miniconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

A    0
B    1
C    2
Name: NYC, dtype: int32

In [15]:
dataframe2

     A  B  C
NYC  0  1  2
LA   3  4  5
CHI  6  7  8

In [16]:
dataframe2-ser3

     A  B  C
NYC  0  0  0
LA   3  3  3
CHI  6  6  6